src/Documents/ИТСервисы_Задачи/ИТСервисы_Задачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИТСервисы_Задачи</name>
  <registerRecords>InformationRegister.ИТСервисы_СостоянияЗадач</registerRecords>
  <registerRecords>AccumulationRegister.ИТСервисы_НагрузкаСотрудникаПоЗадачам</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ИТСервисы_Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ИТСервисы_СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.ИТСервисы_ПриоритетыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяТрудоемкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяТрудоемкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИнтеграционныйКонтур</name>
    <attributes>
      <name>UUIDСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KaitenID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KaitenCardURL</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзмененПослеСинхронизации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоследнейСинхронизации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийСтатус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ИТСервисы_СостоянияЗадач/ИТСервисы_СостоянияЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТСервисы_СостоянияЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.ИТСервисы_СтатусыЗадач</types>
    </type>
  </resources>
  <resources>
    <name>ПлановаяТрудоемкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактическаяТрудоемкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ИТСервисы_Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.ИТСервисы_ПриоритетыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>KaitenID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийСтатус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>KaitenCardURL</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененПослеСинхронизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейСинхронизации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.ИТСервисы_Задачи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/ИТСервисы_НагрузкаСотрудникаПоЗадачам/ИТСервисы_НагрузкаСотрудникаПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ИТСервисы_НагрузкаСотрудникаПоЗадачам</name>
  <resources>
    <name>ПланЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ИТСервисы_Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/ИТСервисы_КомандыПроектов/ИТСервисы_КомандыПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТСервисы_КомандыПроектов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РольВКоманде</name>
    <type>
      <types>CatalogRef.ИТСервисы_РолиВКомандах</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентЗагрузкиНаПроекте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ИТСервисы_Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ИТСервисы_СтатусыЗадач/ИТСервисы_СтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИТСервисы_СтатусыЗадач</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>НаПроверке</name>
  </enumValues>
  <enumValues>
    <name>Завершена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ИТСервисы_ПриоритетыЗадач/ИТСервисы_ПриоритетыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИТСервисы_ПриоритетыЗадач</name>
  <enumValues>
    <name>Низкий</name>
  </enumValues>
  <enumValues>
    <name>Средний</name>
  </enumValues>
  <enumValues>
    <name>Высокий</name>
  </enumValues>
  <enumValues>
    <name>Критический</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ИТСервисы_Задачи/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ЭтоСлужебнаяЗапись = Ложь;
	Если ДополнительныеСвойства.Свойство("ЭтоСлужебнаяЗаписьИнтеграции", ЭтоСлужебнаяЗапись)
		И ЭтоСлужебнаяЗапись Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.ИТСервисы_СтатусыЗадач.Новая;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Приоритет) Тогда
		Приоритет = Перечисления.ИТСервисы_ПриоритетыЗадач.Средний;
	КонецЕсли;

	Если ИнтеграционныйКонтур.Количество() = 0 Тогда
		НоваяСтрока = ИнтеграционныйКонтур.Добавить();
		НоваяСтрока.UUIDСтроки = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
	
	Если ПустаяСтрока(ИнтеграционныйКонтур[0].UUIDСтроки) Тогда
		ИнтеграционныйКонтур[0].UUIDСтроки = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;

	Если НЕ ЭтоНовый() И НЕ ПометкаУдаления И Ссылка.ПометкаУдаления Тогда
		ИнтеграционныйКонтур[0].UUIDСтроки = Строка(Новый УникальныйИдентификатор());
		ИнтеграционныйКонтур[0].KaitenID = "";
		ИнтеграционныйКонтур[0].KaitenCardURL = "";
		ИнтеграционныйКонтур[0].ВнешнийСтатус = "";
	КонецЕсли;

	ИнтеграционныйКонтур[0].ИзмененПослеСинхронизации = Истина;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ИТСервисы_СостоянияЗадач.Записывать = Истина;
	Движения.ИТСервисы_СостоянияЗадач.Очистить();

	Движения.ИТСервисы_НагрузкаСотрудникаПоЗадачам.Записывать = Истина;
	Движения.ИТСервисы_НагрузкаСотрудникаПоЗадачам.Очистить();

	СтрокаИнтеграции = Неопределено;
	Если ИнтеграционныйКонтур.Количество() > 0 Тогда
		СтрокаИнтеграции = ИнтеграционныйКонтур[0];
	КонецЕсли;

	Запись = Движения.ИТСервисы_СостоянияЗадач.Добавить();
	Запись.Период = Дата;
	Запись.Задача = Ссылка;
	Запись.Статус = Статус;
	Запись.ПлановаяТрудоемкость = ПлановаяТрудоемкость;
	Запись.ФактическаяТрудоемкость = ФактическаяТрудоемкость;
	Запись.Проект = Проект; 
	Запись.Исполнитель = Исполнитель;
	Запись.Приоритет = Приоритет;
	Запись.ДатаНачала = ДатаНачала;
	Запись.ДатаОкончания = ДатаОкончания;

	Если СтрокаИнтеграции <> Неопределено Тогда
		Запись.KaitenID = СтрокаИнтеграции.KaitenID;
		Запись.ВнешнийСтатус = СтрокаИнтеграции.ВнешнийСтатус;
		Запись.KaitenCardURL = СтрокаИнтеграции.KaitenCardURL;
		Запись.ИзмененПослеСинхронизации = СтрокаИнтеграции.ИзмененПослеСинхронизации;
		Запись.ДатаПоследнейСинхронизации = СтрокаИнтеграции.ДатаПоследнейСинхронизации;
	Иначе
		Запись.ИзмененПослеСинхронизации = Истина;
	КонецЕсли;

	МесячноеРаспределение = ПолучитьРаспределениеЧасовПоМесяцам(ДатаНачала, ДатаОкончания, ПлановаяТрудоемкость);

	Для Каждого СтрокаМесяца Из МесячноеРаспределение Цикл

		ЗаписьНагрузки = Движения.ИТСервисы_НагрузкаСотрудникаПоЗадачам.Добавить();
		ЗаписьНагрузки.ВидДвижения = ВидДвиженияНакопления.Приход;
		ЗаписьНагрузки.Период = СтрокаМесяца.Период;
		ЗаписьНагрузки.Проект = Проект; 
		ЗаписьНагрузки.Исполнитель = Исполнитель;
		ЗаписьНагрузки.ПланЧасов = СтрокаМесяца.Часы;
		ЗаписьНагрузки.ФактЧасов = 0;

	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ДатаОкончания < ДатаНачала Тогда
		Сообщить("Дата окончания меньше даты начала.");
		Отказ = Истина;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПлановаяТрудоемкость) И ПлановаяТрудоемкость < 0 Тогда
		Сообщить("Плановая трудоёмкость не может быть отрицательной.");
		Отказ = Истина;
	КонецЕсли;

	Если ЗначениеЗаполнено(ФактическаяТрудоемкость) И ФактическаяТрудоемкость < 0 Тогда
		Сообщить("Фактическая трудоёмкость не может быть отрицательной.");
		Отказ = Истина;
	КонецЕсли;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
 
	НазначенияСотрудников = ПолучитьНазначенияСотрудниковНаПроект(ДатаОкончания);
	ПотребностьПоМесяцам = СформироватьПотребностьПоНагрузке();
	ДоступныеЧасы = ПолучитьДоступныеЧасыПакетно(ПотребностьПоМесяцам);
	УжеНазначенныеЧасы = ПолучитьУжеНазначенныеЧасыПакетно(ПотребностьПоМесяцам);

	КлючНазначения = ПолучитьКлючНазначения(Проект, Исполнитель);

	Если НазначенияСотрудников.Получить(КлючНазначения) = Неопределено Тогда
		Сообщить("Сотрудник не назначен на выбранный Проект.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ТекстОшибкиПерегрузки = ПроверитьПерегрузкуСотрудникаПоСтроке(ПотребностьПоМесяцам, ДоступныеЧасы, УжеНазначенныеЧасы);

	Если НЕ ПустаяСтрока(ТекстОшибкиПерегрузки) Тогда
		Сообщить(ТекстОшибкиПерегрузки);
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьКлючНазначения(ВхПроект, ВхИсполнитель) Экспорт
	Возврат Строка(ВхПроект) + "|" + Строка(ВхИсполнитель);
КонецФункции

Функция ПолучитьКлючНагрузки(ВхПроект, ВхИсполнитель, ПериодНагрузки) Экспорт
	Возврат Строка(ВхПроект) + "|" + Строка(ВхИсполнитель) + "|" + Формат(ПериодНагрузки, "ДФ='yyyyMMdd'");
КонецФункции

Функция ПолучитьНазначенияСотрудниковНаПроект(ДатаПроверки) Экспорт
	Результат = Новый Соответствие;

	Если НЕ ЗначениеЗаполнено(Проект) Или НЕ ЗначениеЗаполнено(Исполнитель) Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Команды.Проект КАК Проект,
	|	Команды.Сотрудник КАК Сотрудник 
	|ИЗ
	|	РегистрСведений.ИТСервисы_КомандыПроектов.СрезПоследних(
	|		&ДатаПроверки,
	|		Проект = &Проект
	|			И Сотрудник = &Исполнитель
	|	) КАК Команды";

	Запрос.УстановитьПараметр("ДатаПроверки", Дата);
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Ключ = ПолучитьКлючНазначения(Выборка.Проект, Выборка.Сотрудник);
		Результат.Вставить(Ключ, Истина);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПолучитьРаспределениеЧасовПоМесяцам(ВхДатаНачала, ВхДатаОкончания, ВхПлановаяТрудоемкость) Экспорт
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Период");
	Таблица.Колонки.Добавить("Часы");

	РабДатаНачала = ?(ЗначениеЗаполнено(ВхДатаНачала), ВхДатаНачала, Дата);
	РабДатаОкончания = ?(ЗначениеЗаполнено(ВхДатаОкончания), ВхДатаОкончания, РабДатаНачала);

	Если РабДатаОкончания < РабДатаНачала Тогда
		Возврат Таблица;
	КонецЕсли;

	КоличествоМесяцев = 0;
	ТекущаяДата = НачалоМесяца(РабДатаНачала);

	Пока ТекущаяДата <= НачалоМесяца(РабДатаОкончания) Цикл
		КоличествоМесяцев = КоличествоМесяцев + 1;
		ТекущаяДата = ДобавитьМесяц(ТекущаяДата, 1);
	КонецЦикла;

	Если КоличествоМесяцев = 0 Тогда
		Возврат Таблица;
	КонецЕсли;

	ЧасыНаМесяц = Окр(ВхПлановаяТрудоемкость / КоличествоМесяцев, 2);
	ОстатокЧасов = ВхПлановаяТрудоемкость;

	ТекущаяДата = НачалоМесяца(РабДатаНачала);
	НомерМесяца = 0;

	Пока ТекущаяДата <= НачалоМесяца(РабДатаОкончания) Цикл

		НомерМесяца = НомерМесяца + 1;
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Период = ТекущаяДата;

		Если НомерМесяца < КоличествоМесяцев Тогда
			НоваяСтрока.Часы = ЧасыНаМесяц;
			ОстатокЧасов = ОстатокЧасов - ЧасыНаМесяц;
		Иначе
			НоваяСтрока.Часы = ОстатокЧасов;
		КонецЕсли;

		ТекущаяДата = ДобавитьМесяц(ТекущаяДата, 1);

	КонецЦикла;

	Возврат Таблица;

КонецФункции

Функция СформироватьПотребностьПоНагрузке() Экспорт
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Проект");
	Таблица.Колонки.Добавить("Исполнитель");
	Таблица.Колонки.Добавить("Период");
	Таблица.Колонки.Добавить("Часы");

	Распределение = ПолучитьРаспределениеЧасовПоМесяцам(ДатаНачала, ДатаОкончания, ПлановаяТрудоемкость);

	Для Каждого СтрокаМесяца Из Распределение Цикл
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Проект = Проект;
		НоваяСтрока.Исполнитель = Исполнитель;
		НоваяСтрока.Период = СтрокаМесяца.Период;
		НоваяСтрока.Часы = СтрокаМесяца.Часы;
	КонецЦикла;

	Возврат Таблица;

КонецФункции

Функция ПолучитьДоступныеЧасыПакетно(ПотребностьПоМесяцам) Экспорт
	Результат = Новый Соответствие;

	Если ПотребностьПоМесяцам.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Команды.Проект КАК Проект,
	|	Команды.Сотрудник КАК Исполнитель,
	|	Команды.ЧасовНаПроекте КАК ЛимитЧасов
	|ИЗ
	|	РегистрСведений.ИТСервисы_КомандыПроектов.СрезПоследних(
	|		&ДатаПроверки,
	|		Проект = &Проект
	|			И Сотрудник = &Исполнитель
	|	) КАК Команды";

	Запрос.УстановитьПараметр("ДатаПроверки", Дата);
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Лимит = Выборка.ЛимитЧасов;
		
		Для Каждого СтрокаПотребности Из ПотребностьПоМесяцам Цикл
			Ключ = ПолучитьКлючНагрузки(Выборка.Проект, Выборка.Исполнитель, НачалоМесяца(СтрокаПотребности.Период));
			Результат.Вставить(Ключ, Лимит);
		КонецЦикла;
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция ПолучитьУжеНазначенныеЧасыПакетно(ПотребностьПоМесяцам) Экспорт
	Результат = Новый Соответствие;

	Если ПотребностьПоМесяцам.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Нагрузка.Проект КАК Проект,
	|	Нагрузка.Исполнитель КАК Исполнитель,
	|	НАЧАЛОПЕРИОДА(Нагрузка.Период, МЕСЯЦ) КАК Период,
	|	СУММА(Нагрузка.ПланЧасов) КАК УжеНазначено
	|ИЗ
	|	РегистрНакопления.ИТСервисы_НагрузкаСотрудникаПоЗадачам КАК Нагрузка
	|ГДЕ
	|	Нагрузка.Проект = &Проект
	|	И Нагрузка.Исполнитель = &Исполнитель
	|	И Нагрузка.Регистратор <> &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	Нагрузка.Проект,
	|	Нагрузка.Исполнитель,
	|	НАЧАЛОПЕРИОДА(Нагрузка.Период, МЕСЯЦ)";

	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Ключ = ПолучитьКлючНагрузки(Выборка.Проект, Выборка.Исполнитель, Выборка.Период);
		Результат.Вставить(Ключ, Выборка.УжеНазначено);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПроверитьПерегрузкуСотрудникаПоСтроке(ПотребностьПоМесяцам, ДоступныеЧасы, УжеНазначенныеЧасы) Экспорт
	Распределение = ПолучитьРаспределениеЧасовПоМесяцам(ДатаНачала, ДатаОкончания, ПлановаяТрудоемкость);

	Для Каждого СтрокаМесяца Из Распределение Цикл

		Ключ = ПолучитьКлючНагрузки(Проект, Исполнитель, СтрокаМесяца.Период);

		Доступно = ДоступныеЧасы.Получить(Ключ);
		Доступно = ?(Доступно = Неопределено Или ТипЗнч(Доступно) = Тип("Null"), 0, Доступно);

		УжеНазначено = УжеНазначенныеЧасы.Получить(Ключ);
		УжеНазначено = ?(УжеНазначено = Неопределено Или ТипЗнч(УжеНазначено) = Тип("Null"), 0, УжеНазначено);

		ОстатокДоступныхЧасов = Макс(0, Доступно - УжеНазначено);

		Если СтрокаМесяца.Часы > ОстатокДоступныхЧасов Тогда
			Возврат "Перегрузка сотрудника. За период " + Формат(СтрокаМесяца.Период, "ДФ='MM.yyyy'") + " доступно ещё " + Строка(Окр(ОстатокДоступныхЧасов, 2)) + " ч.";
		КонецЕсли;

	КонецЦикла;

	Возврат "";

КонецФункции
